{
    "projetos": [
        {
            "nome": "Sistema e Dashboard de Monitoramento de Clientes",
            "tecnologias": ["Python", "SQL", "AWS"],
            "situacao": "Era necessário desenvolver uma solução para monitorar a conexão de mais de 2500 equipamentos de clientes em tempo real.",
            "acao": "Desenvolvi um dashboard integrado a um sistema web por meio de APIs, com monitoramento em tempo real, alertas personalizados via email usando SNS e SQS e geração automática de relatórios.",
            "resultado": "Reduziu o tempo de instabilidade e inoperabilidade dos equipamentos em 90%.",
            "imagens": [
                "./assets/img/projetos/dashboard-equipamentos/dashboard-equipamentos-1.png",
                "./assets/img/projetos/dashboard-equipamentos/dashboard-equipamentos-2.png",
                "./assets/img/projetos/dashboard-equipamentos/dashboard-equipamentos-3.png"
            ]
        },
        {
            "nome": "Automação de Conexão e Extração de Informações de banco de Dados em Núvem",
            "tecnologias": ["Python", "SQL", "AWS"],
            "situacao": "A empresa enfrentava desafios na extração manual e no tempo de resposta para coleta de dados de grandes volumes em bancos de dados hospedados na nuvem.",
            "acao": "Desenvolvi uma automação usando Python para a conexão via SSH e extração de informações diretamente dos bancos de dados na nuvem AWS.",
            "resultado": "Reduziu o tempo de coleta de dados em 83,4%, impactando significativamente os processos de coleção de dados.",
            "imagens": [
                "./assets/img/projetos/automacao-banco/automacao-banco-1.png"
            ]
        },
        {
            "nome": "Web Scraping de Dados para Exportação",
            "tecnologias": ["Python"],
            "situacao": "Durante um período de migração de sistemas, claboradores internos necessitavam de uma solução para exportar dados de um sistema legado para um novo sistema.",
            "acao": "Desenvolvi um script de web scraping que pegava dados da interface web do sistema legado e os tratava, para inserir as informações no novo sistema.",
            "resultado": "Reduziu o tempo de coleta, tratamento e importação de dados em 83,4%.",
            "imagens": [
                "./assets/img/projetos/executavel-importacao/executavel-importacao-1.png",
                "./assets/img/projetos/executavel-importacao/executavel-importacao-2.png"
            ]
        },
        {
            "nome": "Automação de Conversão e Importação de Dados",
            "tecnologias": ["Python"],
            "situacao": "Durante um período de migração de sistema, o processo de importação de dados para o novo sistema estava sendo feito manualmente, o que gerava um alto custo de tempo e esforço humano.",
            "acao": "Desenvolvi uma solução que realizava web scraping usando Selenium na interface do sistema antigo, extraindo as informações necessárias, salvando-as em um arquivo CSV e, em seguida, importando automaticamente esse CSV para uma funcionalidade nativa do novo sistema.",
            "resultado": "A solução resultou em um aumento de produtividade de 60% e eliminou mais de 90% da intervenção manual no processo de importação de dados.",
            "imagens": [
                "./assets/img/projetos/automacao-importacao-dados/automacao-importacao-dados-1.png"
            ]
        },
        {
            "nome": "Dashboard de Controle de Chamados de Q.A.",
            "tecnologias": ["Python"],
            "situacao": "Necessidade de  monitorar e analisar os chamados de Q.A de forma eficiente e interativa.",
            "acao": "Desenvolvi um script que realizava web scraping utilizando Python na plataforma para coletar os dados dos chamados. Esses dados foram tratados e convertidos em CSV. Em seguida, foi desenvolvido um dashboard web usando Dash e Plotly para visualização interativa das informações.",
            "resultado": "Proporcionou uma visualização clara e dinâmica dos chamados de Q.A, facilitando o acompanhamento e a análise das métricas, o que contribuiu para otimizar o processo de gestão e resolução de problemas.",
            "imagens": [
                "./assets/img/projetos/dashboard-chamados/dashboard-chamados-1.png",
                "./assets/img/projetos/dashboard-chamados/dashboard-chamados-2.png",
                "./assets/img/projetos/dashboard-chamados/dashboard-chamados-3.png"
            ]
        },
        {
            "nome": "Dashboard sobre Redes Sociais e Privacidade na Internet",
            "tecnologias": ["Power BI"],
            "situacao": "Era necessário entender a percepção dos usuários sobre o impacto das redes sociais na privacidade online. ",
            "acao": "Foi elaborado e disponibilizado um questionário, seguido pelo tratamento dos dados e análise estatística. Com base nos resultados, foi criado um dashboard interativo no Power BI para visualização das métricas.",
            "resultado": "A análise revelou insights sobre as preocupações dos usuários com a privacidade nas redes sociais, fornecendo informações valiosas para aprimorar posíveis políticas de privacidade e estratégias digitais.",
            "imagens": [
                "./assets/img/projetos/dashboard-redes-sociais/dashboard-redes-sociais-1.jpg",
                "./assets/img/projetos/dashboard-redes-sociais/dashboard-redes-sociais-2.jpg",
                "./assets/img/projetos/dashboard-redes-sociais/dashboard-redes-sociais-3.jpg"
            ]
        }
    ]
}